python/11.excel-and-csv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Excel 或者 csv 文件</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">Excel 或者 csv 文件</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeba364a">1. Excel</a>
<ul>
<li><a href="#org8a3d5cf">1.1. pandas</a></li>
<li><a href="#orgcdcf797">1.2. xlrd</a></li>
<li><a href="#orgeebef64">1.3. xlwt</a></li>
</ul>
</li>
<li><a href="#org0ddf165">2. csv</a>
<ul>
<li><a href="#org24f6537">2.1. 读取 csv 文件</a></li>
<li><a href="#org280e65d">2.2. 写入 csv 文件</a></li>
<li><a href="#orgd6096e0">2.3. 使用 csv 读写文件的例子</a></li>
</ul>
</li>
<li><a href="#org8c41cad">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgeba364a" class="outline-2">
<h2 id="orgeba364a"><span class="section-number-2">1</span> Excel</h2>
<div class="outline-text-2" id="text-1">
<p>
Python 不是自带操作 Excel 的包，需要安装第三方包来完成相应的操作。常见的可以操作
Excel 文件的包有：pandas, openpyxl, xlrd, xlutils 和 pyexcel。
</p>
</div>

<div id="outline-container-org8a3d5cf" class="outline-3">
<h3 id="org8a3d5cf"><span class="section-number-3">1.1</span> pandas</h3>
<div class="outline-text-3" id="text-1-1">
<p>
读取 Excel 中的数据
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> pandas <span style="color: #859900;">as</span> pd
<span style="color: #6c71c4;">xl</span> = pd.ExcelFile<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'example.xlsx'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>xl.sheet_names<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">df1</span> = xl.parse<span style="color: #8d5649;">(</span>xl.sheet_names<span style="color: #d8241f;">[</span>0<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>df1<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
['Sheet1']
0  1
1  3
2  5
3  6
4  8

</pre>

<p>
将数据写入 Excel 文件
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> numpy <span style="color: #859900;">as</span> np
<span style="color: #859900;">import</span> pandas <span style="color: #859900;">as</span> pd
<span style="color: #6c71c4;">data</span> =   pd.Series<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1,3,5,6,8<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">writer</span> = pd.ExcelWriter<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'example.xlsx'</span>, engine=<span style="color: #2aa198;">'xlsxwriter'</span><span style="color: #8d5649;">)</span>
data.to_excel<span style="color: #8d5649;">(</span>writer, <span style="color: #2aa198;">'Sheet1'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>data<span style="color: #8d5649;">)</span>
writer.save<span style="color: #8d5649;">()</span>
</pre>
</div>

<pre class="example">
0    1
1    3
2    5
3    6
4    8
dtype: int64

</pre>
</div>
</div>

<div id="outline-container-orgcdcf797" class="outline-3">
<h3 id="orgcdcf797"><span class="section-number-3">1.2</span> xlrd</h3>
<div class="outline-text-3" id="text-1-2">
<p>
xlrd 可以操作 Excel，如果想要轻量级操作可以使用这个包，并且 pandas 读取 Excel 底
层也是调用 xlrd 的。 xlrd 的缺点是 <b>只能读取，不能写入</b> 。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> xlrd
<span style="color: #6c71c4;">workbook</span> = xlrd.open_workbook<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'example.xlsx'</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">workbook</span> = xlrd.open_workbook<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'example.xlsx'</span>, on_demand = <span style="color: #268bd2;">True</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>workbook.sheet_names<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>workbook.sheets<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">sheet</span> = workbook.sheet_by_name<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'Sheet1'</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">sheet</span> = workbook.sheet_by_index<span style="color: #8d5649;">(</span>0<span style="color: #8d5649;">)</span>

<span style="color: #6c71c4;">row</span>, <span style="color: #6c71c4;">col</span> = 3, 0
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">ctype : 0 empty,1 string, 2 number, 3 date, 4 boolean, 5 error</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>sheet.cell<span style="color: #d8241f;">(</span>row, col<span style="color: #d8241f;">)</span>.ctype<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>sheet.cell<span style="color: #d8241f;">(</span>row, col<span style="color: #d8241f;">)</span>.value<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>sheet.nrows, sheet.ncols<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>sheet.col_values<span style="color: #d8241f;">(</span>0<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>sheet.row_values<span style="color: #d8241f;">(</span>4<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
['Sheet1']
[&lt;xlrd.sheet.Sheet object at 0x000000001407E208&gt;]
2
2.0
6 2
['', 0.0, 1.0, 2.0, 3.0, 4.0]
[3.0, 6.0]

</pre>
</div>
</div>

<div id="outline-container-orgeebef64" class="outline-3">
<h3 id="orgeebef64"><span class="section-number-3">1.3</span> xlwt</h3>
<div class="outline-text-3" id="text-1-3">
<p>
xlwt 可以写入 Excel 文件，具体使用方式见代码
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> xlwt

<span style="color: #6c71c4;">book</span> = xlwt.Workbook<span style="color: #8d5649;">(</span>encoding=<span style="color: #2aa198;">"utf-8"</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">sheet1</span> = book.add_sheet<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"Sheet1"</span><span style="color: #8d5649;">)</span>
sheet1.write<span style="color: #8d5649;">(</span>0, 0, <span style="color: #2aa198;">"Hello world"</span><span style="color: #8d5649;">)</span>
book.save<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"sheet1.xls"</span><span style="color: #8d5649;">)</span>

<span style="color: #6c71c4;">book</span> = xlwt.Workbook<span style="color: #8d5649;">()</span>
<span style="color: #6c71c4;">sheet1</span> = book.add_sheet<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"Sheet1"</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">cols</span> = <span style="color: #8d5649;">[</span><span style="color: #2aa198;">"A"</span>, <span style="color: #2aa198;">"B"</span>, <span style="color: #2aa198;">"C"</span>, <span style="color: #2aa198;">"D"</span>, <span style="color: #2aa198;">"E"</span><span style="color: #8d5649;">]</span>
<span style="color: #6c71c4;">txt</span> = <span style="color: #8d5649;">[</span>0,1,2,3,4<span style="color: #8d5649;">]</span>
<span style="color: #859900;">for</span> num <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span><span style="color: #8d5649;">(</span>5<span style="color: #8d5649;">)</span>:
  <span style="color: #6c71c4;">row</span> = sheet1.row<span style="color: #8d5649;">(</span>num<span style="color: #8d5649;">)</span>
  <span style="color: #859900;">for</span> index, col <span style="color: #859900;">in</span> <span style="color: #6c71c4;">enumerate</span><span style="color: #8d5649;">(</span>cols<span style="color: #8d5649;">)</span>:
    <span style="color: #6c71c4;">value</span> = txt<span style="color: #8d5649;">[</span>index<span style="color: #8d5649;">]</span> + num
    row.write<span style="color: #8d5649;">(</span>index, value<span style="color: #8d5649;">)</span>
book.save<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"test.xls"</span><span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org0ddf165" class="outline-2">
<h2 id="org0ddf165"><span class="section-number-2">2</span> csv</h2>
<div class="outline-text-2" id="text-2">
<p>
Python 自带读写 csv 文件的模块，可以直接导入 csv 模块。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> csv
</pre>
</div>
</div>

<div id="outline-container-org24f6537" class="outline-3">
<h3 id="org24f6537"><span class="section-number-3">2.1</span> 读取 csv 文件</h3>
<div class="outline-text-3" id="text-2-1">
<p>
使用函数方式读取 csv 文件
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">with</span> <span style="color: #6c71c4;">open</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'eggs.csv'</span>, <span style="color: #2aa198;">'rb'</span><span style="color: #8d5649;">)</span> <span style="color: #859900;">as</span> csvfile:
  <span style="color: #6c71c4;">spamreader</span> = csv.reader<span style="color: #8d5649;">(</span>csvfile, delimiter=<span style="color: #2aa198;">' '</span>, quotechar=<span style="color: #2aa198;">'|'</span><span style="color: #8d5649;">)</span>
  <span style="color: #859900;">for</span> row <span style="color: #859900;">in</span> spamreader:
    <span style="color: #859900;">print</span> <span style="color: #2aa198;">', '</span>.join<span style="color: #8d5649;">(</span>row<span style="color: #8d5649;">)</span>
</pre>
</div>

<p>
使用类方式读取 csv 文件
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">with</span> <span style="color: #6c71c4;">open</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'names.csv'</span><span style="color: #8d5649;">)</span> <span style="color: #859900;">as</span> csvfile:
  <span style="color: #6c71c4;">reader</span> = csv.DictReader<span style="color: #8d5649;">(</span>csvfile<span style="color: #8d5649;">)</span>
  <span style="color: #859900;">for</span> row <span style="color: #859900;">in</span> reader:
    <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>row<span style="color: #d8241f;">[</span><span style="color: #2aa198;">'first_name'</span><span style="color: #d8241f;">]</span>, row<span style="color: #d8241f;">[</span><span style="color: #2aa198;">'last_name'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org280e65d" class="outline-3">
<h3 id="org280e65d"><span class="section-number-3">2.2</span> 写入 csv 文件</h3>
<div class="outline-text-3" id="text-2-2">
<p>
使用函数方式写入 csv 文件
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">with</span> <span style="color: #6c71c4;">open</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'eggs.csv'</span>, <span style="color: #2aa198;">'wb'</span><span style="color: #8d5649;">)</span> <span style="color: #859900;">as</span> csvfile:
  <span style="color: #6c71c4;">spamwriter</span> = csv.writer<span style="color: #8d5649;">(</span>csvfile, delimiter=<span style="color: #2aa198;">' '</span>, quotechar=<span style="color: #2aa198;">'|'</span>, quoting=csv.QUOTE_MINIMAL<span style="color: #8d5649;">)</span>
  spamwriter.writerow<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Spam'</span><span style="color: #d8241f;">]</span> * 5 + <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Baked Beans'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
  spamwriter.writerow<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Spam'</span>, <span style="color: #2aa198;">'Lovely Spam'</span>, <span style="color: #2aa198;">'Wonderful Spam'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<p>
使用类方式写入 csv 文件
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">with</span> <span style="color: #6c71c4;">open</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'names.csv'</span>, <span style="color: #2aa198;">'w'</span><span style="color: #8d5649;">)</span> <span style="color: #859900;">as</span> csvfile:
  <span style="color: #6c71c4;">fieldnames</span> = <span style="color: #8d5649;">[</span><span style="color: #2aa198;">'first_name'</span>, <span style="color: #2aa198;">'last_name'</span><span style="color: #8d5649;">]</span>
  <span style="color: #6c71c4;">writer</span> = csv.DictWriter<span style="color: #8d5649;">(</span>csvfile, fieldnames=fieldnames<span style="color: #8d5649;">)</span>
  writer.writeheader<span style="color: #8d5649;">()</span>
  writer.writerow<span style="color: #8d5649;">(</span><span style="color: #d8241f;">{</span><span style="color: #2aa198;">'first_name'</span>: <span style="color: #2aa198;">'Baked'</span>, <span style="color: #2aa198;">'last_name'</span>: <span style="color: #2aa198;">'Beans'</span><span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>
  writer.writerow<span style="color: #8d5649;">(</span><span style="color: #d8241f;">{</span><span style="color: #2aa198;">'first_name'</span>: <span style="color: #2aa198;">'Lovely'</span>, <span style="color: #2aa198;">'last_name'</span>: <span style="color: #2aa198;">'Spam'</span><span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>
  writer.writerow<span style="color: #8d5649;">(</span><span style="color: #d8241f;">{</span><span style="color: #2aa198;">'first_name'</span>: <span style="color: #2aa198;">'Wonderful'</span>, <span style="color: #2aa198;">'last_name'</span>: <span style="color: #2aa198;">'Spam'</span><span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6096e0" class="outline-3">
<h3 id="orgd6096e0"><span class="section-number-3">2.3</span> 使用 csv 读写文件的例子</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> csv, codecs, cStringIO

<span style="color: #859900;">class</span> <span style="color: #268bd2;">UTF8Recoder</span>:
  <span style="color: #d33682;">"""</span>
<span style="color: #d33682;">  Iterator that reads an encoded stream and reencodes the input to UTF-8</span>
<span style="color: #d33682;">  """</span>
  <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>, f, encoding<span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">self</span>.reader = codecs.getreader<span style="color: #8d5649;">(</span>encoding<span style="color: #8d5649;">)(</span>f<span style="color: #8d5649;">)</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">__iter__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">return</span> <span style="color: #859900;">self</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">next</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">return</span> <span style="color: #859900;">self</span>.reader.<span style="color: #6c71c4;">next</span><span style="color: #8d5649;">()</span>.encode<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"utf-8"</span><span style="color: #8d5649;">)</span>

<span style="color: #859900;">class</span> <span style="color: #268bd2;">UnicodeReader</span>:
  <span style="color: #d33682;">"""</span>
<span style="color: #d33682;">  A CSV reader which will iterate over lines in the CSV file "f",</span>
<span style="color: #d33682;">  which is encoded in the given encoding.</span>
<span style="color: #d33682;">  """</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>, f, dialect=csv.excel, encoding=<span style="color: #2aa198;">"utf-8"</span>, **kwds<span style="color: #8d5649;">)</span>:
    <span style="color: #6c71c4;">f</span> = UTF8Recoder<span style="color: #8d5649;">(</span>f, encoding<span style="color: #8d5649;">)</span>
    <span style="color: #859900;">self</span>.reader = csv.reader<span style="color: #8d5649;">(</span>f, dialect=dialect, **kwds<span style="color: #8d5649;">)</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">next</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
    <span style="color: #6c71c4;">row</span> = <span style="color: #859900;">self</span>.reader.<span style="color: #6c71c4;">next</span><span style="color: #8d5649;">()</span>
    <span style="color: #859900;">return</span> <span style="color: #8d5649;">[</span><span style="color: #6c71c4;">unicode</span><span style="color: #d8241f;">(</span>s, <span style="color: #2aa198;">"utf-8"</span><span style="color: #d8241f;">)</span> <span style="color: #859900;">for</span> s <span style="color: #859900;">in</span> row<span style="color: #8d5649;">]</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">__iter__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">return</span> <span style="color: #859900;">self</span>

<span style="color: #859900;">class</span> <span style="color: #268bd2;">UnicodeWriter</span>:
  <span style="color: #d33682;">"""</span>
<span style="color: #d33682;">  A CSV writer which will write rows to CSV file "f",</span>
<span style="color: #d33682;">  which is encoded in the given encoding.</span>
<span style="color: #d33682;">  """</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>, f, dialect=csv.excel, encoding=<span style="color: #2aa198;">"utf-8"</span>, **kwds<span style="color: #8d5649;">)</span>:
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">Redirect output to a queue</span>
    <span style="color: #859900;">self</span>.queue = cStringIO.StringIO<span style="color: #8d5649;">()</span>
    <span style="color: #859900;">self</span>.writer = csv.writer<span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>.queue, dialect=dialect, **kwds<span style="color: #8d5649;">)</span>
    <span style="color: #859900;">self</span>.stream = f
    <span style="color: #859900;">self</span>.encoder = codecs.getincrementalencoder<span style="color: #8d5649;">(</span>encoding<span style="color: #8d5649;">)()</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">writerow</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>, row<span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">self</span>.writer.writerow<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>s.encode<span style="color: #9564bf;">(</span><span style="color: #2aa198;">"utf-8"</span><span style="color: #9564bf;">)</span> <span style="color: #859900;">for</span> s <span style="color: #859900;">in</span> row<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">Fetch UTF-8 output from the queue ...</span>
    <span style="color: #6c71c4;">data</span> = <span style="color: #859900;">self</span>.queue.getvalue<span style="color: #8d5649;">()</span>
    <span style="color: #6c71c4;">data</span> = data.decode<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"utf-8"</span><span style="color: #8d5649;">)</span>
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">... and reencode it into the target encoding</span>
    <span style="color: #6c71c4;">data</span> = <span style="color: #859900;">self</span>.encoder.encode<span style="color: #8d5649;">(</span>data<span style="color: #8d5649;">)</span>
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">write to the target stream</span>
    <span style="color: #859900;">self</span>.stream.write<span style="color: #8d5649;">(</span>data<span style="color: #8d5649;">)</span>
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">empty queue</span>
    <span style="color: #859900;">self</span>.queue.truncate<span style="color: #8d5649;">(</span>0<span style="color: #8d5649;">)</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">writerows</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>, rows<span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">for</span> row <span style="color: #859900;">in</span> rows:
      <span style="color: #859900;">self</span>.writerow<span style="color: #8d5649;">(</span>row<span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org8c41cad" class="outline-2">
<h2 id="org8c41cad"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://xlrd.readthedocs.io/en/latest/">xlrd</a></li>
<li><a href="https://xlwt.readthedocs.io/en/latest/">xlwt</a></li>
<li><a href="https://pyexcel.readthedocs.io/en/latest/">pyexcel</a></li>
<li><a href="https://docs.python.org/3/library/csv.html">csv</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-24 Wed 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
